PMo_manipulated/Graphviz/17.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ExclusiveGateway_5" -> "Process refund";
  "Process refund" -> "ExclusiveGateway_6";
  "ExclusiveGateway_6" -> "ExclusiveGateway_10";
  "Check stock\navailability" -> "ExclusiveGateway_9";
  "ParallelGateway_2" -> "Package items";
  "Receive back-order" -> "ExclusiveGateway_3";
  "ExclusiveGateway_11" -> "Check stock\navailability";
  "ExclusiveGateway_7" -> "ParallelGateway_3";
  "Send return shipping\nlabel" -> "Receive returned\nitems";
  "Confirm delivery" -> "Send follow-up email";
  "ExclusiveGateway_12" -> "Customer reports\nissue";
  "ExclusiveGateway_12" -> "ExclusiveGateway_10";
  "ParallelGateway_1" -> "Update inventory\nlevels";
  "Customer reports\nissue" -> "Send return shipping\nlabel";
  "ExclusiveGateway_11" -> "Notify about failed\npayment";
  "ParallelGateway_4" -> "Confirm delivery";
  "Inspect returned\nitems" -> "ExclusiveGateway_5";
  "Perform quality\ncontrol checks" -> "ParallelGateway_2";
  "Update inventory\nlevels" -> "ParallelGateway_4";
  "start" -> "Place order";
  "Package items" -> "ExclusiveGateway_2";
  "ExclusiveGateway_4" -> "ExclusiveGateway_8";
  "Send shipping\nconfirmation to\ncustomer" -> "ParallelGateway_4";
  "Notify about failed\npayment" -> "ExclusiveGateway_1";
  "ExclusiveGateway_3" -> "Pick items from\nwarehouse";
  "Pick items from\nwarehouse" -> "Perform quality\ncontrol checks";
  "Dispatch order" -> "ParallelGateway_1";
  "ExclusiveGateway_1" -> "end";
  "ParallelGateway_1" -> "Send shipping\nconfirmation to\ncustomer";
  "ParallelGateway_3" -> "Dispatch order";
  "ExclusiveGateway_2" -> "ExclusiveGateway_7";
  "ExclusiveGateway_2" -> "Gift wrap items";
  "ExclusiveGateway_4" -> "Prepare\ndocumentation for\ninternational orders";
  "Gift wrap items" -> "ExclusiveGateway_7";
  "ExclusiveGateway_8" -> "ParallelGateway_3";
  "Process payment" -> "ExclusiveGateway_11";
  "Initiate back-order" -> "Inform customer\nabout delay";
  "ParallelGateway_2" -> "Prepare shipping\ndocuments and labels";
  "Record order details" -> "Process payment";
  "Receive returned\nitems" -> "Inspect returned\nitems";
  "Process replacement" -> "ExclusiveGateway_6";
  "ExclusiveGateway_9" -> "Initiate back-order";
  "ExclusiveGateway_9" -> "ExclusiveGateway_3";
  "ParallelGateway_2" -> "ExclusiveGateway_4";
  "ExclusiveGateway_5" -> "Process replacement";
  "Prepare shipping\ndocuments and labels" -> "ParallelGateway_3";
  "Inform customer\nabout delay" -> "Receive back-order";
  "Prepare\ndocumentation for\ninternational orders" -> "ExclusiveGateway_8";
  "Place order" -> "Record order details";
  "Send follow-up email" -> "ExclusiveGateway_12";
  "Send follow-up email" -> "Send return shipping\nlabel";

  "start" [shape=circle];
  "end" [shape=circle, penwidth=4];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "ExclusiveGateway_7" [label="X", shape=diamond];
  "ExclusiveGateway_8" [label="X", shape=diamond];
  "ExclusiveGateway_9" [label="X", shape=diamond];
  "ExclusiveGateway_10" [label="X", shape=diamond];
  "ExclusiveGateway_11" [label="X", shape=diamond];
  "ExclusiveGateway_12" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
