pmo-dataset/mermaid/17.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	ExclusiveGateway_5{"X"} --> Task_11["Process refund"]
	Task_11 --> ExclusiveGateway_6{"X"}
	ExclusiveGateway_6 --> ExclusiveGateway_10{"X"}
	Task_9["Check stock\navailability"] --> ExclusiveGateway_9{"X"}
	ParallelGateway_2{"+"} --> Task_21["Package items"]
	Task_3["Receive back-order"] --> ExclusiveGateway_3{"X"}
	ExclusiveGateway_11{"X"} --> Task_9
	ExclusiveGateway_10 --> ExclusiveGateway_1{"X"}
	ExclusiveGateway_7{"X"} --> ParallelGateway_3{"+"}
	Task_17["Send return shipping\nlabel"] --> Task_24["Receive returned\nitems"]
	Task_2["Confirm delivery"] --> Task_22["Send follow-up email"]
	ExclusiveGateway_12{"X"} --> Task_6["Customer reports\nissue"]
	ExclusiveGateway_12 --> ExclusiveGateway_10
	ParallelGateway_1{"+"} --> Task_14["Update inventory\nlevels"]
	Task_6 --> Task_17
	ExclusiveGateway_11 --> Task_13["Notify about failed\npayment"]
	ParallelGateway_4{"+"} --> Task_2
	Task_12["Inspect returned\nitems"] --> ExclusiveGateway_5
	Task_7["Perform quality\ncontrol checks"] --> ParallelGateway_2
	Task_14 --> ParallelGateway_4
	StartNoneEvent_1(("start")) --> Task_25["Place order"]
	Task_21 --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_4{"X"} --> ExclusiveGateway_8{"X"}
	Task_20["Send shipping\nconfirmation to\ncustomer"] --> ParallelGateway_4
	Task_13 --> ExclusiveGateway_1
	ExclusiveGateway_3 --> Task_19["Pick items from\nwarehouse"]
	Task_19 --> Task_7
	Task_8["Dispatch order"] --> ParallelGateway_1
	ExclusiveGateway_1 --> EndNoneEvent_1(("end")):::endEvent
	ParallelGateway_1 --> Task_20
	ParallelGateway_3 --> Task_8
	ExclusiveGateway_2 --> ExclusiveGateway_7
	ExclusiveGateway_2 --> Task_15["Gift wrap items"]
	ExclusiveGateway_4 --> Task_4["Prepare\ndocumentation for\ninternational orders"]
	Task_15 --> ExclusiveGateway_7
	ExclusiveGateway_8 --> ParallelGateway_3
	Task_1["Process payment"] --> ExclusiveGateway_11
	Task_5["Initiate back-order"] --> Task_16["Inform customer\nabout delay"]
	ParallelGateway_2 --> Task_10["Prepare shipping\ndocuments and labels"]
	Task_23["Record order details"] --> Task_1
	Task_24 --> Task_12
	Task_18["Process replacement"] --> ExclusiveGateway_6
	ExclusiveGateway_9 --> Task_5
	ExclusiveGateway_9 --> ExclusiveGateway_3
	ParallelGateway_2 --> ExclusiveGateway_4
	ExclusiveGateway_5 --> Task_18
	Task_10 --> ParallelGateway_3
	Task_16 --> Task_3
	Task_4 --> ExclusiveGateway_8
	Task_25 --> Task_23
	Task_22 --> ExclusiveGateway_12
